In [1]:
import numpy as np

In [2]:
from pandas import Series, DataFrame
import pandas as pd

In [3]:
frame = DataFrame(np.random.randint(0,9,size=(5,4)))

In [4]:
frame

   0  1  2  3
0  8  2  6  5
1  7  7  1  3
2  2  7  1  7
3  1  0  5  0
4  1  7  5  1

In [5]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
0    5 non-null int32
1    5 non-null int32
2    5 non-null int32
3    5 non-null int32
dtypes: int32(4)
memory usage: 160.0 bytes

In [7]:
frame.index = ['zhangsan','lisi','wangwu','qianliu','tanqi']

In [8]:
frame

          0  1  2  3
zhangsan  8  2  6  5
lisi      7  7  1  3
wangwu    2  7  1  7
qianliu   1  0  5  0
tanqi     1  7  5  1

In [10]:
frame.columns=['feature1','feature2','feature3','feature4']

In [11]:
frame

          feature1  feature2  feature3  feature4
zhangsan         8         2         6         5
lisi             7         7         1         3
wangwu           2         7         1         7
qianliu          1         0         5         0
tanqi            1         7         5         1

In [12]:
frame.name = 'sample'

In [14]:
frame.index.name = 'name'

In [15]:
frame

          feature1  feature2  feature3  feature4
name
zhangsan         8         2         6         5
lisi             7         7         1         3
wangwu           2         7         1         7
qianliu          1         0         5         0
tanqi            1         7         5         1

In [17]:
frame.columns.name = 'feature'

In [18]:
frame

feature   feature1  feature2  feature3  feature4
name
zhangsan         8         2         6         5
lisi             7         7         1         3
wangwu           2         7         1         7
qianliu          1         0         5         0
tanqi            1         7         5         1

In [19]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, zhangsan to tanqi
Data columns (total 4 columns):
feature1    5 non-null int32
feature2    5 non-null int32
feature3    5 non-null int32
feature4    5 non-null int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [20]:
frame.name

'sample'

In [21]:
frame['feature2']

name
zhangsan    2
lisi        7
wangwu      7
qianliu     0
tanqi       7
Name: feature2, dtype: int32

In [22]:
frame.ix['tanqi']

feature
feature1    1
feature2    7
feature3    5
feature4    1
Name: tanqi, dtype: int32

In [23]:
frame.loc['lisi','feature4']

3

In [24]:
frame.loc['zhangsan':'qianliu',:]

feature   feature1  feature2  feature3  feature4
name
zhangsan         8         2         6         5
lisi             7         7         1         3
wangwu           2         7         1         7
qianliu          1         0         5         0

In [27]:
frame.loc['zhangsan':'qianliu',:]

feature   feature1  feature2  feature3  feature4
name
zhangsan         8         2         6         5
lisi             7         7         1         3
wangwu           2         7         1         7
qianliu          1         0         5         0

In [28]:
frame.iloc[0:2,:]

feature   feature1  feature2  feature3  feature4
name
zhangsan         8         2         6         5
lisi             7         7         1         3

In [29]:
frame.iloc[0:2,1:4]

feature   feature2  feature3  feature4
name
zhangsan         2         6         5
lisi             7         1         3

In [31]:
frame.iloc[1:2,1:4]

feature  feature2  feature3  feature4
name
lisi            7         1         3

In [35]:
frame.loc['lisi':'qianliu','feature2':'feature3']

feature  feature2  feature3
name
lisi            7         1
wangwu          7         1
qianliu         0         5

In [40]:
frame['feature5'] = frame.sum(axis=1)

In [41]:
frame

feature   feature1  feature2  feature3  feature4  feature5
name
zhangsan         8         2         6         5      21.0
lisi             7         7         1         3      18.0
wangwu           2         7         1         7      17.0
qianliu          1         0         5         0       6.0
tanqi            1         7         5         1      14.0

In [43]:
frame.values

array([[ 8.,  2.,  6.,  5., 21.],
       [ 7.,  7.,  1.,  3., 18.],
       [ 2.,  7.,  1.,  7., 17.],
       [ 1.,  0.,  5.,  0.,  6.],
       [ 1.,  7.,  5.,  1., 14.]])

In [45]:
del frame['feature5']

In [46]:
frame

feature   feature1  feature2  feature3  feature4
name
zhangsan         8         2         6         5
lisi             7         7         1         3
wangwu           2         7         1         7
qianliu          1         0         5         0
tanqi            1         7         5         1

In [48]:
frame2 =frame.reindex(['feature4','feature2','feature1','feature3'])

In [50]:
del frame2

In [51]:
frame

feature   feature1  feature2  feature3  feature4
name
zhangsan         8         2         6         5
lisi             7         7         1         3
wangwu           2         7         1         7
qianliu          1         0         5         0
tanqi            1         7         5         1

In [61]:
data1 = pd.read_table("G:\\CnCqLeeds\\data\\B2006data\\data1.txt")

In [62]:
data1.head()

    PtID  CD4Date  CD4Count  RNADate  VLoad
0  23424      0.0     178.0      0.0    5.5
1  23424      4.0     228.0      4.0    3.9
2  23424      8.0     126.0      8.0    4.7
3  23424     25.0     171.0     25.0    4.0
4  23424     40.0      99.0     40.0    5.0

In [71]:
columns = ['ID','Method','Age','Time','Log_CD4']
data2 = pd.read_table("G:\\CnCqLeeds\\data\\B2006data\\data2.txt",\
                      header=None)
data2.columns = columns

In [72]:
data2.head()

   ID  Method      Age     Time  Log_CD4
0   1       2  36.4271   0.0000   3.1355
1   1       2  36.4271   7.5714   3.0445
2   1       2  36.4271  15.5714   2.7726
3   1       2  36.4271  23.5714   2.8332
4   1       2  36.4271  32.5714   3.2189